Revit 2025 API
RebarSpliceUtils.SpliceRebar(Document, ElementId, RebarSpliceOptions, IList<RebarSpliceGeometry>) Method
 Splice a rebar with a list of RebarSpliceGeometry.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static IList<ElementId> SpliceRebar(
	Document document,
	ElementId rebarIdToSplit,
	RebarSpliceOptions spliceOptions,
	IList<RebarSpliceGeometry> spliceGeometries
)
Public Shared Function SpliceRebar (
	document As Document,
	rebarIdToSplit As ElementId,
	spliceOptions As RebarSpliceOptions,
	spliceGeometries As IList(Of RebarSpliceGeometry)
) As IList(Of ElementId)
public:
static IList<ElementId^>^ SpliceRebar(
	Document^ document,
	ElementId^ rebarIdToSplit,
	RebarSpliceOptions^ spliceOptions,
	IList<RebarSpliceGeometry^>^ spliceGeometries
)
static member SpliceRebar :
        document : Document *
        rebarIdToSplit : ElementId *
        spliceOptions : RebarSpliceOptions *
        spliceGeometries : IList<RebarSpliceGeometry> -> IList<ElementId>
Parameters
document Document
 The document
rebarIdToSplit ElementId
 Rebar id to split.
spliceOptions RebarSpliceOptions
 The rebar splice options.
spliceGeometries IList<RebarSpliceGeometry>
 A list of RebarSpliceGeometry that indicates where the rebar will be spliced.
Return Value
IList<ElementId>
 Returns the ids of the rebars that are considered to be spliced.
Exceptions
Exception | Condition
ArgumentException |  Free Form Rebars, or Shape Driven Rebars that are Multiplanar or have a shape that whose definition is RebarShapeDefinitionByArc can't be spliced. Also, if the Rebar is member of a Group it cannot be spliced.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarSpliceUtils Class
SpliceRebar Overload
Autodesk.Revit.DB.Structure Namespace